#include <stdio.h>

int main(void)
{
// 整数の場合 （変換指定子が`d`や`o`など） 
/*
	printf("[%d]\n", 1234567);
	printf("[%d]\n", -1234567);

	printf("[%.0d]\n", 1234567);
	printf("[%.5d]\n", 1234567);

	printf("[%.10d]\n", 1234567);
	printf("[%.10d]\n", -1234567);


// 変換指定子が`f`, `e`, `E`の場合
	printf("[%f]\n", 123.321);
	printf("[%f]\n", -123.321);
	printf("[%f]\n", 1234567.7654321);
	printf("[%f]\n", -1234567.7654321);

	printf("[%e]\n", 123.321);
	printf("[%e]\n", -123.321);
	printf("[%e]\n", 1234567.7654321);
	printf("[%e]\n", -1234567.7654321);

	printf("[%E]\n", 123.321);
	printf("[%E]\n", -123.321);
	printf("[%E]\n", 1234567.7654321);
	printf("[%E]\n", -1234567.7654321);

	printf("[%.0f]\n", 123.321);
	printf("[%.0f]\n", 1234567.7654321);
	printf("[%.5f]\n", 1234567.7654321);

	printf("[%.0e]\n", 123.321);
	printf("[%.0e]\n", 1234567.7654321);
	printf("[%.5e]\n", 1234567.7654321);

	printf("[%.0E]\n", 123.321);
	printf("[%.0E]\n", 1234567.7654321);
	printf("[%.5E]\n", 1234567.7654321);

	printf("[%.5f]\n", 123.321);
	printf("[%.10f]\n", 123.321);
	printf("[%.10f]\n", -123.321);
	printf("[%.10f]\n", 1234567.7654321);
	printf("[%.10f]\n", -1234567.7654321);

	printf("[%.5e]\n", 123.321);
	printf("[%.10e]\n", 123.321);
	printf("[%.10e]\n", -123.321);
	printf("[%.10e]\n", 1234567.7654321);
	printf("[%.10e]\n", -1234567.7654321);

	printf("[%.5E]\n", 123.321);
	printf("[%.10E]\n", 123.321);
	printf("[%.10E]\n", -123.321);
	printf("[%.10E]\n", 1234567.7654321);
	printf("[%.10E]\n", -1234567.7654321);


//変換指定子が`g`, `G`の場合
	printf("[%g]\n", 123.321);
	printf("[%G]\n", 123.321);
	printf("[%g]\n", -123.321);
	printf("[%G]\n", -123.321);
*/

	printf("[%.0g]\n", 123.321);
	printf("[%.0G]\n", 123.321);
	printf("[%.1g]\n", 123.321);
	printf("[%.1G]\n", 123.321);
	printf("[%.2g]\n", 123.321);
	printf("[%.2G]\n", 123.321);
	printf("[%.3g]\n", 123.321);
	printf("[%.3G]\n", 123.321);

	printf("[%.10g]\n", 123.321);
	printf("[%.10G]\n", 123.321);
	printf("[%.10g]\n", -123.321);
	printf("[%.10G]\n", -123.321);

	printf("[%.20g]\n", 123.321);
	printf("[%.20G]\n", 123.321);
	printf("[%.20g]\n", -123.321);
	printf("[%.20G]\n", -123.321);

	printf("[%.20g]\n", 1234567.7654321);
	printf("[%.20G]\n", 1234567.7654321);
	printf("[%.20g]\n", -1234567.7654321);
	printf("[%.20G]\n", -1234567.7654321);
/*
//文字列の場合
	printf("[%s]\n", "apple");
	printf("[%.3s]\n", "apple");
	printf("[%.10s]\n", "apple");

//'.'を使用したケース
printf("[%.d]\n", 1234567);

	//以下'*'の場合
// 整数の場合 （変換指定子が`d`や`o`など） 
	printf("[%.*d]\n", 0, 1234567);
	printf("[%.*d]\n", 5, 1234567);

	int	a = 10;
	printf("[%.*d]\n", a, 1234567);
	printf("[%.*d]\n", 10, 1234567);
	printf("[%.*d]\n", 10, -1234567);
// 変換指定子が`f`, `e`, `E`の場合

	printf("[%.*f]\n", 0, 123.321);
	printf("[%.*f]\n", 5, 123.321);

	printf("[%.*f]\n", 10, 123.321);
	printf("[%.*f]\n", 10, -123.321);

	printf("[%.*f]\n", 10, 1234567.7654321);
	printf("[%.*f]\n", 10, -1234567.7654321);

//変換指定子が`g`, `G`の場合
	printf("[%.*g]\n", 0, 123.321);
	printf("[%.*g]\n", 5, 123.321);

	printf("[%.*g]\n", 10, 123.321);
	printf("[%.*g]\n", 10, -123.321);

	printf("[%.*g]\n", 20, 1234567.7654321);
	printf("[%.*g]\n", 20, -1234567.7654321);

//文字列の場合
	printf("[%.*s]\n", 3, "apple");
	printf("[%.*s]\n", 10, "apple");
*/
	return (0);
}
